Revit 2027 API
AdvancedWood.WoodUseGrooveRoughness Property
 The property labeled "Use additional groove roughness" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodUseGrooveRoughness { get; }
Public Shared ReadOnly Property WoodUseGrooveRoughness As String
	Get
public:
static property String^ WoodUseGrooveRoughness {
	String^ get ();
}
static member WoodUseGrooveRoughness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace